{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "Transformer2DModel",
    "parent_library": "diffusers.models.transformers.transformer_2d"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 1,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "to_out.0",
    "to_v",
    "proj_out",
    "to_k",
    "to_q",
    "linear_2",
    "proj_in"
  ],
  "task_type": null
}